#+TITLE: Gloo cncf/k8s-conformance
* Gloo
#+begin_src tmate :window kind :tangle gloo.sh :tangle-mode (identity #o755) :comments no
  #!/usr/bin/env bash
  set -x
#+end_src

** Deploy APISnoop in kind
#+begin_src tmate :window kind :tangle gloo.sh :tangle-mode (identity #o755)
  kind create cluster --config kind+apisnoop.yaml
#+end_src
** install gloo
#+begin_src tmate :window gloo
  brew install solo-io/tap/glooctl
#+end_src

#+begin_src shell
  glooctl version
#+end_src

#+RESULTS:
#+begin_example
Client: {"version":"1.3.17"}
Server: {"type":"Gateway","kubernetes":{"containers":[{"Tag":"1.3.17","Name":"discovery","Registry":"quay.io/solo-io"},{"Tag":"1.3.17","Name":"gateway","Registry":"quay.io/solo-io"},{"Tag":"1.3.17","Name":"gloo-envoy-wrapper","Registry":"quay.io/solo-io"},{"Tag":"1.3.17","Name":"gloo","Registry":"quay.io/solo-io"}],"namespace":"gloo-system"}}
#+end_example

** install gateway
#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
  cat <<EOF | glooctl install gateway --values -
  gatewayProxies:
    gatewayProxy:
      service:
        type: NodePort
        httpPort: 31500
        httpsPort: 32500
        httpNodePort: 31500
        httpsNodePort: 32500
  EOF
#+end_src

#+RESULTS:
#+begin_example
#+end_example
** deploy petstore
#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
 kubectl apply -f https://raw.githubusercontent.com/solo-io/gloo/v1.2.9/example/petstore/petstore.yaml
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/petstore unchanged
service/petstore unchanged
#+end_example

#+begin_src shell
  kubectl get svc petstore
#+end_src

#+RESULTS:
#+begin_example
NAME       TYPE        CLUSTER-IP     EXTERNAL-IP   PORT(S)    AGE
petstore   ClusterIP   10.96.139.41   <none>        8080/TCP   11m
#+end_example

#+begin_src shell
  glooctl get upstreams
#+end_src

#+RESULTS:
#+begin_example
+---------------------------------+------------+----------+------------------------------+
|            UPSTREAM             |    TYPE    |  STATUS  |           DETAILS            |
+---------------------------------+------------+----------+------------------------------+
| default-kubernetes-443          | Kubernetes | Accepted | svc name:      kubernetes    |
|                                 |            |          | svc namespace: default       |
|                                 |            |          | port:          443           |
|                                 |            |          |                              |
| default-petstore-8080           | Kubernetes | Accepted | svc name:      petstore      |
|                                 |            |          | svc namespace: default       |
|                                 |            |          | port:          8080          |
|                                 |            |          | REST service:                |
|                                 |            |          | functions:                   |
|                                 |            |          | - addPet                     |
|                                 |            |          | - deletePet                  |
|                                 |            |          | - findPetById                |
|                                 |            |          | - findPets                   |
|                                 |            |          |                              |
| gloo-system-gateway-443         | Kubernetes | Accepted | svc name:      gateway       |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          443           |
|                                 |            |          |                              |
| gloo-system-gateway-proxy-31500 | Kubernetes | Accepted | svc name:      gateway-proxy |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          31500         |
|                                 |            |          |                              |
| gloo-system-gateway-proxy-32500 | Kubernetes | Pending  | svc name:      gateway-proxy |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          32500         |
|                                 |            |          |                              |
| gloo-system-gloo-9966           | Kubernetes | Accepted | svc name:      gloo          |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          9966          |
|                                 |            |          |                              |
| gloo-system-gloo-9977           | Kubernetes | Accepted | svc name:      gloo          |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          9977          |
|                                 |            |          |                              |
| gloo-system-gloo-9979           | Kubernetes | Accepted | svc name:      gloo          |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          9979          |
|                                 |            |          |                              |
| gloo-system-gloo-9988           | Kubernetes | Accepted | svc name:      gloo          |
|                                 |            |          | svc namespace: gloo-system   |
|                                 |            |          | port:          9988          |
|                                 |            |          |                              |
| kube-system-kube-dns-53         | Kubernetes | Accepted | svc name:      kube-dns      |
|                                 |            |          | svc namespace: kube-system   |
|                                 |            |          | port:          53            |
|                                 |            |          |                              |
| kube-system-kube-dns-9153       | Kubernetes | Accepted | svc name:      kube-dns      |
|                                 |            |          | svc namespace: kube-system   |
|                                 |            |          | port:          9153          |
|                                 |            |          |                              |
+---------------------------------+------------+----------+------------------------------+
#+end_example
#+begin_src shell :wrap "SRC yaml"
 glooctl get upstream default-petstore-8080 --output kube-yaml
#+end_src

#+RESULTS:
#+begin_SRC yaml
apiVersion: gloo.solo.io/v1
kind: Upstream
metadata:
  annotations:
    kubectl.kubernetes.io/last-applied-configuration: |
      {"apiVersion":"v1","kind":"Service","metadata":{"annotations":{},"labels":{"service":"petstore"},"name":"petstore","namespace":"default"},"spec":{"ports":[{"port":8080,"protocol":"TCP"}],"selector":{"app":"petstore"}}}
  creationTimestamp: null
  generation: 4
  labels:
    discovered_by: kubernetesplugin
    service: petstore
  name: default-petstore-8080
  namespace: gloo-system
  resourceVersion: "3333"
spec:
  discoveryMetadata: {}
  kube:
    selector:
      app: petstore
    serviceName: petstore
    serviceNamespace: default
    servicePort: 8080
    serviceSpec:
      rest:
        swaggerInfo:
          url: http://petstore.default.svc.cluster.local:8080/swagger.json
        transformations:
          addPet:
            body:
              text: '{"id": {{ default(id, "") }},"name": "{{ default(name, "")}}","tag":
                "{{ default(tag, "")}}"}'
            headers:
              :method:
                text: POST
              :path:
                text: /api/pets
              content-type:
                text: application/json
          deletePet:
            headers:
              :method:
                text: DELETE
              :path:
                text: /api/pets/{{ default(id, "") }}
              content-type:
                text: application/json
          findPetById:
            body: {}
            headers:
              :method:
                text: GET
              :path:
                text: /api/pets/{{ default(id, "") }}
              content-length:
                text: "0"
              content-type: {}
              transfer-encoding: {}
          findPets:
            body: {}
            headers:
              :method:
                text: GET
              :path:
                text: /api/pets?tags={{default(tags, "")}}&limit={{default(limit,
                  "")}}
              content-length:
                text: "0"
              content-type: {}
              transfer-encoding: {}
status:
  reported_by: gloo
  state: 1

#+end_SRC

#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
  kubectl label namespace default  discovery.solo.io/function_discovery=enabled
#+end_src

#+RESULTS:
#+begin_example
#+end_example
#+begin_src shell
 glooctl get upstream default-petstore-8080
#+end_src

#+RESULTS:
#+begin_example
+-----------------------+------------+----------+-------------------------+
|       UPSTREAM        |    TYPE    |  STATUS  |         DETAILS         |
+-----------------------+------------+----------+-------------------------+
| default-petstore-8080 | Kubernetes | Accepted | svc name:      petstore |
|                       |            |          | svc namespace: default  |
|                       |            |          | port:          8080     |
|                       |            |          | REST service:           |
|                       |            |          | functions:              |
|                       |            |          | - addPet                |
|                       |            |          | - deletePet             |
|                       |            |          | - findPetById           |
|                       |            |          | - findPets              |
|                       |            |          |                         |
+-----------------------+------------+----------+-------------------------+
#+end_example

#+begin_src shell :wrap "SRC yaml"
 glooctl get upstream default-petstore-8080 --output kube-yaml
#+end_src

#+RESULTS:
#+begin_SRC yaml
apiVersion: gloo.solo.io/v1
kind: Upstream
metadata:
  annotations:
    kubectl.kubernetes.io/last-applied-configuration: |
      {"apiVersion":"v1","kind":"Service","metadata":{"annotations":{},"labels":{"service":"petstore"},"name":"petstore","namespace":"default"},"spec":{"ports":[{"port":8080,"protocol":"TCP"}],"selector":{"app":"petstore"}}}
  creationTimestamp: null
  generation: 4
  labels:
    discovered_by: kubernetesplugin
    service: petstore
  name: default-petstore-8080
  namespace: gloo-system
  resourceVersion: "1172"
spec:
  discoveryMetadata: {}
  kube:
    selector:
      app: petstore
    serviceName: petstore
    serviceNamespace: default
    servicePort: 8080
    serviceSpec:
      rest:
        swaggerInfo:
          url: http://petstore.default.svc.cluster.local:8080/swagger.json
        transformations:
          addPet:
            body:
              text: '{"id": {{ default(id, "") }},"name": "{{ default(name, "")}}","tag":
                "{{ default(tag, "")}}"}'
            headers:
              :method:
                text: POST
              :path:
                text: /api/pets
              content-type:
                text: application/json
          deletePet:
            headers:
              :method:
                text: DELETE
              :path:
                text: /api/pets/{{ default(id, "") }}
              content-type:
                text: application/json
          findPetById:
            body: {}
            headers:
              :method:
                text: GET
              :path:
                text: /api/pets/{{ default(id, "") }}
              content-length:
                text: "0"
              content-type: {}
              transfer-encoding: {}
          findPets:
            body: {}
            headers:
              :method:
                text: GET
              :path:
                text: /api/pets?tags={{default(tags, "")}}&limit={{default(limit,
                  "")}}
              content-length:
                text: "0"
              content-type: {}
              transfer-encoding: {}
status:
  reported_by: gloo
  state: 1

#+end_SRC
** Ensure gateway-proxy Deployment is Available

#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
  kubectl wait --for=condition=Available --selector=gloo=gateway-proxy -n gloo-system deployment
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/gateway-proxy condition met
#+end_example
** Add route

#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
  glooctl add route \
    --path-exact /all-pets \
    --dest-name default-petstore-8080 \
    --prefix-rewrite /api/pets
#+end_src

#+RESULTS:
#+begin_example
+-----------------+--------------+---------+------+---------+-----------------+-----------------------------------+
| VIRTUAL SERVICE | DISPLAY NAME | DOMAINS | SSL  | STATUS  | LISTENERPLUGINS |              ROUTES               |
+-----------------+--------------+---------+------+---------+-----------------+-----------------------------------+
| default         |              | *       | none | Pending |                 | /all-pets ->                      |
|                 |              |         |      |         |                 | gloo-system.default-petstore-8080 |
|                 |              |         |      |         |                 | (upstream)                        |
+-----------------+--------------+---------+------+---------+-----------------+-----------------------------------+
#+end_example
** ensure default virutalservice is Accepted
#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
  set +x
  echo -n Waiting for default virtual service to be Accepted...
  while [ $(glooctl get virtualservice  default -o json | jq -r '.[0].status.state') != "Accepted" ] ; do echo -n . ; sleep 1 ; done
  echo !
  glooctl get virtualservice  default
  echo -n Waiting for upstream default-petstore-8080 to be Accepted...
  while [ $(glooctl get upstream default-petstore-8080 -o json | jq -r '.[0].status.state') != "Accepted" ] ; do echo -n . ; sleep 1 ; done
  echo !
  glooctl get upstream default-petstore-8080
  set -x
#+end_src

#+RESULTS:
#+begin_example
Waiting for default virtual service to be Accepted...!
+-----------------+--------------+---------+------+----------+-----------------+-----------------------------------+
| VIRTUAL SERVICE | DISPLAY NAME | DOMAINS | SSL  |  STATUS  | LISTENERPLUGINS |              ROUTES               |
+-----------------+--------------+---------+------+----------+-----------------+-----------------------------------+
| default         |              | *       | none | Accepted |                 | /all-pets ->                      |
|                 |              |         |      |          |                 | gloo-system.default-petstore-8080 |
|                 |              |         |      |          |                 | (upstream)                        |
+-----------------+--------------+---------+------+----------+-----------------+-----------------------------------+
Waiting for upstream default-petstore-8080 to be Accepted...!
+-----------------------+------------+----------+-------------------------+
|       UPSTREAM        |    TYPE    |  STATUS  |         DETAILS         |
+-----------------------+------------+----------+-------------------------+
| default-petstore-8080 | Kubernetes | Accepted | svc name:      petstore |
|                       |            |          | svc namespace: default  |
|                       |            |          | port:          8080     |
|                       |            |          | REST service:           |
|                       |            |          | functions:              |
|                       |            |          | - addPet                |
|                       |            |          | - deletePet             |
|                       |            |          | - findPetById           |
|                       |            |          | - findPets              |
|                       |            |          |                         |
+-----------------------+------------+----------+-------------------------+
#+end_example


#+begin_src shell
  glooctl get virtualservice default --output kube-yaml
#+end_src

#+RESULTS:
#+begin_example
apiVersion: gateway.solo.io/v1
kind: VirtualService
metadata:
  creationTimestamp: null
  generation: 3
  name: default
  namespace: gloo-system
  resourceVersion: "3514"
spec:
  virtualHost:
    domains:
    - '*'
    routes:
    - matchers:
      - exact: /all-pets
      options:
        prefixRewrite: /api/pets
      routeAction:
        single:
          upstream:
            name: default-petstore-8080
            namespace: gloo-system
status:
  reported_by: gateway
  state: 1
  subresource_statuses:
    '*v1.Proxy.gloo-system.gateway-proxy':
      reported_by: gloo
      state: 1

#+end_example

#+begin_src shell
  glooctl proxy url
#+end_src

#+RESULTS:
#+begin_example
http://172.18.0.2:31407
#+end_example

** Connect to route
#+begin_src shell :tangle gloo.sh :tangle-mode (identity #o755)
  curl $(glooctl proxy url)/all-pets
#+end_src

#+RESULTS:
#+begin_example
[{"id":1,"name":"Dog","status":"available"},{"id":2,"name":"Cat","status":"pending"}]
#+end_example
* SQL Research
** clients
#+begin_src sql-mode
  select useragent
    from testing.audit_event
   where useragent like 'gloo%'
   group by useragent;
#+end_src

#+RESULTS:
#+begin_SRC example
                    useragent
--------------------------------------------------
 glooctl/v0.0.0 (darwin/amd64) kubernetes/$Format
 gloo/v0.0.0 (linux/amd64) kubernetes/$Format
(2 rows)

#+end_SRC

** endpoints
#+begin_src sql-mode
  select endpoint
    from testing.audit_event
   where useragent like 'gloo%'
   group by endpoint;
#+end_src

#+RESULTS:
#+begin_SRC example
                  endpoint
---------------------------------------------

 listCoreV1ConfigMapForAllNamespaces
 getStorageV1APIResources
 getNodeV1beta1APIResources
 getSchedulingV1APIResources
 getCertificatesV1APIResources
 listCoreV1Namespace
 getRbacAuthorizationV1APIResources
 getNetworkingV1APIResources
 listCoreV1NamespacedSecret
 getBatchV1beta1APIResources
 readCoreV1NamespacedService
 getAuthorizationV1APIResources
 getAdmissionregistrationV1APIResources
 getCoordinationV1APIResources
 getAuthenticationV1APIResources
 listCoreV1EndpointsForAllNamespaces
 getEventsV1beta1APIResources
 getAuthenticationV1beta1APIResources
 getApiextensionsV1APIResources
 getAPIVersions
 listCoreV1SecretForAllNamespaces
 getDiscoveryV1beta1APIResources
 getAuthorizationV1beta1APIResources
 getPolicyV1beta1APIResources
 readCoreV1Node
 replaceCoreV1NamespacedConfigMap
 getCertificatesV1beta1APIResources
 getAutoscalingV2beta1APIResources
 getExtensionsV1beta1APIResources
 getRbacAuthorizationV1beta1APIResources
 getCodeVersion
 listCoreV1ServiceForAllNamespaces
 readCoreV1NamespacedConfigMap
 listCoreV1PodForAllNamespaces
 getAppsV1APIResources
 getAutoscalingV2beta2APIResources
 listAppsV1NamespacedDeployment
 getAutoscalingV1APIResources
 getApiregistrationV1APIResources
 createCoreV1Namespace
 getApiextensionsV1beta1APIResources
 getBatchV1APIResources
 createCoreV1NamespacedSecret
 getAdmissionregistrationV1beta1APIResources
 getCoreV1APIResources
 getCoreAPIVersions
 getStorageV1beta1APIResources
 getEventsV1APIResources
 getApiregistrationV1beta1APIResources
 replaceCoreV1NamespacedSecret
 getNetworkingV1beta1APIResources
 readCoreV1Namespace
 getCoordinationV1beta1APIResources
 getSchedulingV1beta1APIResources
 listCoreV1NamespacedPod
(56 rows)

#+end_SRC
** untested
   #+begin_src sql-mode
select * from describe_columns('public','endpoint_coverage');
   #+end_src

   #+RESULTS:
   #+begin_SRC example
      column    |                                 description
   -------------+-----------------------------------------------------------------------------
    release     | the open api release, date of endpoint details
    endpoint    | a kubernetes endpoint, the operation_id in the spec
    level       | alpha, beta, or stable
    category    | endpoint category, roughly its group, taken from the first tag in the spec.
    path        | the http path of the endpoint
    description |
    kind        | k8s kind  for endpoint
    version     | k8s version for endpoint
    group       | k8s group for endpoint
    action      | endpoint action, roughly related to an http method
    tested      | was endpoint hit at least once by a test useragent
    conf_tested | was endpoint hit at least once by a conformance test useragent
    tests       | array of codenames of all tests that hit this endpoint
   (13 rows)

   #+end_SRC

#+begin_src sql-mode
  select endpoint, tested, conf_tested
    from        testing.audit_event
           join endpoint_coverage ec using(endpoint)
   where useragent like 'gloo%'
     and ec.release = '1.20.0'
   group by endpoint, ec.release, tested, conf_tested
   order by conf_tested asc;
#+end_src

#+RESULTS:
#+begin_SRC example
                  endpoint                   | tested | conf_tested
---------------------------------------------+--------+-------------
 getCodeVersion                              | f      | f
 createCoreV1Namespace                       | t      | t
 createCoreV1NamespacedSecret                | t      | t
 getAdmissionregistrationV1APIResources      | t      | t
 getAdmissionregistrationV1beta1APIResources | t      | t
 getApiextensionsV1APIResources              | t      | t
 getApiextensionsV1beta1APIResources         | t      | t
 getApiregistrationV1APIResources            | t      | t
 getApiregistrationV1beta1APIResources       | t      | t
 getAPIVersions                              | t      | t
 getAppsV1APIResources                       | t      | t
 getAuthenticationV1APIResources             | t      | t
 getAuthenticationV1beta1APIResources        | t      | t
 getAuthorizationV1APIResources              | t      | t
 getAuthorizationV1beta1APIResources         | t      | t
 getAutoscalingV1APIResources                | t      | t
 getAutoscalingV2beta1APIResources           | t      | t
 getAutoscalingV2beta2APIResources           | t      | t
 getBatchV1APIResources                      | t      | t
 getBatchV1beta1APIResources                 | t      | t
 getCertificatesV1APIResources               | t      | t
 getCertificatesV1beta1APIResources          | t      | t
 getCoordinationV1APIResources               | t      | t
 getCoordinationV1beta1APIResources          | t      | t
 getCoreAPIVersions                          | t      | t
 getCoreV1APIResources                       | t      | t
 getDiscoveryV1beta1APIResources             | t      | t
 getEventsV1APIResources                     | t      | t
 getEventsV1beta1APIResources                | t      | t
 getExtensionsV1beta1APIResources            | t      | t
 getNetworkingV1APIResources                 | t      | t
 getNetworkingV1beta1APIResources            | t      | t
 getNodeV1beta1APIResources                  | t      | t
 getPolicyV1beta1APIResources                | t      | t
 getRbacAuthorizationV1APIResources          | t      | t
 getRbacAuthorizationV1beta1APIResources     | t      | t
 getSchedulingV1APIResources                 | t      | t
 getSchedulingV1beta1APIResources            | t      | t
 getStorageV1APIResources                    | t      | t
 getStorageV1beta1APIResources               | t      | t
 listAppsV1NamespacedDeployment              | t      | t
 listCoreV1ConfigMapForAllNamespaces         | t      | t
 listCoreV1EndpointsForAllNamespaces         | t      | t
 listCoreV1Namespace                         | t      | t
 listCoreV1NamespacedPod                     | t      | t
 listCoreV1NamespacedSecret                  | t      | t
 listCoreV1PodForAllNamespaces               | t      | t
 listCoreV1SecretForAllNamespaces            | t      | t
 listCoreV1ServiceForAllNamespaces           | t      | t
 readCoreV1Namespace                         | t      | t
 readCoreV1NamespacedConfigMap               | t      | t
 readCoreV1NamespacedService                 | t      | t
 readCoreV1Node                              | t      | t
 replaceCoreV1NamespacedConfigMap            | t      | t
 replaceCoreV1NamespacedSecret               | t      | t
(55 rows)

#+end_SRC
